// JavaScriptにはいくつかのデータの型がある

// ---- プリミティブ型(データの基本形) ----

// 数値:number - 計算ができたりする
// ex) 1, 100, -100, 0

// 真偽値:boolean - 正しいが間違っているかを判断する値(true/false)
// true, false

// 文字列:string - 文字として判断
// ex) "123", '文字です', `バッククォーテーション`

// null:null - 値がないこと
// null

// undefined:undefined - 値が定義されていない
// undefined

// -------------------------------------

// typeof データの型を教えてくれる演算子
// console.log(typeof 'true');

// コメントアウト
// これは1行コメントアウト

/* ここから

複数行

ここまで */

// 変数宣言
// 値を格納する箱のイメージ

// var <- 使わないように(好ましくない挙動を起こす可能性がある)
// let
// const
